<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ESET Endpoint Anti-Virus for Mac.</string>
    <key>Identifier</key>
    <string>com.github.jbaker10.download.ESETEndpointAntiVirus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ESET Endpoint Anti-Virus</string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.eset.com/com/eset/apps/business/eea/mac/latest/eea_osx_en.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
<!--         <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/AcronisAccessInstaller.dmg/Acronis Access.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.grouplogic.activEcho" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8EKZLH8YNG")</string>
            </dict>
        </dict> -->
    </array>
</dict>
</plist>
