<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest full installer of EndNote X7 and builds an Apple installer pkg.</string>
  <key>Identifier</key>
  <string>com.github.jbaker10.pkg.EndNoteX7</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>EndNote_X7</string>
    <key>PKG_ID</key>
    <string>com.company.EndNote</string>
  </dict>
  <key>ParentRecipe</key>
  <string>com.github.jbaker10.download.EndNoteX7</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>Versioner</string>
      <key>Arguments</key>
      <dict>
        <key>input_plist_path</key>
        <string>%pathname%/Endnote X7/EndNote X7.app/Contents/Info.plist</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/pkg</string>
        <key>pkgdirs</key>
        <dict>
          <key>Applications</key>
          <string>0775</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%pathname%/EndNote X7</string>
        <key>destination_path</key>
        <string>%pkgroot%/Applications/EndNote X7</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_request</key>
        <dict>
          <key>pkgname</key>
          <string>%NAME%-%version%</string>
          <key>version</key>
          <string>%version%</string>
          <key>id</key>
          <string>%PKG_ID%</string>
          <key>options</key>
          <string>purge_ds_store</string>
          <key>chown</key>
          <array>
            <dict>
              <key>path</key>
              <string>Applications</string>
              <key>user</key>
              <string>root</string>
              <key>group</key>
              <string>admin</string>
            </dict>
          </array>
        </dict>
      </dict>
    </dict>
  </array>
</dict>
</plist>
