<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest EndNote X7 release and unzips the contents.</string>
	<key>Identifier</key>
	<string>com.github.jbaker10.download.EndNoteX7Updates</string>
	<!-- A big thanks to Allister Banks for finding the XML file with download info! -->
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EndNote</string>
		<key>version</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://download.endnote.com/updates/17.0/EN17MacUpdates.xml</string>
				<key>re_pattern</key>
				<string>(/updates/17.0/EndNoteX7[0-9]UpdateInstaller.zip)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>http://download.endnote.com%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/EndNote X7.4 Update Installer/EndNote X7.4 Updater.app</string>
				<key>requirement</key>
				<string>anchor trusted</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>