<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest EndNote X7 release, unzips the contents, and creates a custom package that will install the EndNote X7 update onto the system. It will also place the CWYW module into the Startup items of Office 2008 and/or 2011.</string>
    <key>Identifier</key>
    <string>com.github.jbaker10.pkg.EndNoteX7Updates</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EndNote</string>
        <key>app_name</key>
        <string>EndNote X7.4 Updater.app</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.jbaker10.download.EndNoteX7Updates</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/EndNote X7.4 Update Installer/EndNote X7.4 Updater.app/Contents/Resources/English.lproj/InfoPlist.strings</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkg</string>
                <key>pkgdirs</key>
                <dict>
                    <key>var</key>
                    <string>0775</string>
                    <key>var/tmp</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/EndNote X7.4 Update Installer/%app_name%</string>
                <key>destination_path</key>
                <string>%pkgroot%/var/tmp/%app_name%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <!-- Would like to make the ID dynamic -->
                    <key>id</key>
                    <string>com.ThomsonResearchSoft.EndNote</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>endnote_scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>var/tmp</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>