<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ESET Endpoint Anti-Virus for macOS, mounts the DMG, and extracts the Installer.pkg, and imports the pkg into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jbaker10.munki.AcronisAccess</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AcronisAccess</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>MAKEPKGINFO_PKGNAME</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Acronis Access Advanced is an easy, complete, and secure enterprise file sharing solution that makes users more productive and gives IT complete control over business content to ensure security, maintain compliance, and enable BYOD. Employees can use any device to securely access, sync and share files with other employees, customers, partners, and vendors.</string>
            <key>display_name</key>
            <string>Acronis Access</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jbaker10.pkg.AcronisAccess</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>munkiimport_pkgname</key>
                <string>%MAKEPKGINFO_PKGNAME%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>